class Palich():
   palich_name = 'Палыч'
   palich_prelude = 'Палыч завалил твой ебалыч - скиллы и предметы не поюзать'
   palich_description = 'Раздает перманентные баны'

class Chaikovskii():
   chaikovskii_name = 'Чайковский'
   chaikovskii_god_city = 'Чайковский здесь чувствует приток самопиздатости\n+100🖤\n+50⚔️\n+10💥'
   chaikovskii_description = 'Одна святая песня воскрешает его перед порогом смерти'
   chaikovskii_ressurection = 'Брат! Не засыпай!'

class Viv():
   viv_name = 'Вив'
   viv_travmat = 'Володя забрал свой травмат!\n-300❤️🩸'
   viv_description = 'В конце хода наваливает бассов повышая свой урон'
   viv_end_skill = 'Бассы подъехали!'

class Sasha():
   sasha_name = 'Саша Шлякин'
   sasha_bye = 'Саша Шлякин нападает только на самого себя, подберем тебе другого'
   sasha_description = 'Убей его и возвысь себя'

class Tvar():
   tvar_name = 'Качаловская Тварь'
   tvar_description = 'Бить ее больно и крайне неприятно, себе хуже только сделаешь'

class Randomich():
   randomich_name = 'Рандом Рандомыч'
   randomich_description = 'Может быть лох, а может и бог'

class Kitty():
   kitty_name = 'Котенок-тролль'
   kitty_description = 'Вислоухий и пузатый, мурчанием вызывает бессилие, еще может закогтить тебя'
   kitty_stan = 'Мурлы-сна!'
   kitty_bleeding = 'Зацепка когтями!'

class Inkvisizia():
   inkvisizia_name = 'Инквизиция'
   inkvisizia_description = 'Неопытных юзеров может моментально умертвить, тут уж как повезет'

class DocLeha():
   doc_leha_name = 'Доктор Леха'
   doc_leha_description = 'Может провести вихревой удар джаггернаута своей сумкой'
   doc_leha_skill = 'Джагернаааааут!'

class DrunkLeha():
   drunk_leha_name = 'Пьяный Леха'
   drunk_leha_description = 'В конце хода накидывает еще коктейльчик, становясь опаснее'
   drunk_leha_skill = 'Леха бухает! Остановите его!'

class Mel():
   mel_name = 'Мел'
   mel_miss = 'Мелу похуй на твой урон'
   mel_description = 'Отсутвие гордости делает его не восприимчивым к урону, замешкаешься - зальет блазуху тебе в ухо'
   mel_end_skill = 'Мел залил тебе блазуху в ухо!'

class Redhead():
   redhead_name = 'Рыжий'
   redhead_prelude = '🦠Рыжий потравил тебя в душу🦠'
   redhead_description = 'Находясь с ним рядом ты травишь свою жизнь, живучая падла'

class Sledovatel():
   sledovatel_name = 'Следователь'
   sledovatel_drugcheck = '👮‍♂️: Употребляли? Тогда быстрее вас упакуем\nСтепень упаковки +50%'
   sledovatel_damage_prelude = 'Злоупотребление дамагом карается по закону!\n-50%⚔️'
   sledovatel_description = 'Если успеет заполнить на тебя доки - будешь упакован в тюрьму'
   sledovatel_skill_meter = 'Степень упаковки'

class Doner():
   doner_name = 'Донер Кебаб'
   doner_kolbas = 'Ой ой, Донер у Колбаса стал крепче\n+500🖤'
   doner_everlast = 'Донер спиздил твой костюм!\n+10%🖤\n+10%⚔️'
   doner_cola = 'Открывая твою Колу, Донер захуярил и себя, и тебя, и обои!\n-500❤️\n-500🖤'
   doner_rampag = 'Рампаг заходит сзади! Моментальная смерть для Донера!'
   doner_booze = 'Пизда твоему бухлу, Донер его выпил\n+150🖤'
   doner_sock = 'Не стоило травить Донера\n+100🖤💕'
   doner_harchok = 'Не стоило травить Донера\n+200🖤💕'
   doner_description = 'При нем лучше не бухать, травля эту мразь делает сильнее'

class BlackStas():
   black_stas_name = 'Черный Стас'
   black_stas_mitya = 'Стас, по-справедливости, бахает столько же эликсиров, что и Митя'
   black_stas_description = 'Правильно выбирай слова для его осадки - закинет за всю хуйню обратно'
   black_stas_returnal = 'Стас отразил твою хуйню'

class Dron():
   dron_name = 'Дрон'
   dron_bratishki = 'За каждый поход к братишкам\n🤬+5%'
   dron_dron_meat = 'А за то что ты ел мясо Андрея\n🤬+10%'
   dron_skill = '☠️Дрон затаил лютую обиду!☠️'
   dron_description = 'Доведешь Андрея до обиды - умрешь в его глазах'
   dron_skill_meter = 'Риск обиды'

class Glad():
   glad_name = 'Валера Гладиатор'
   glad_damage_skill = 'Твин-турбо гадза на минус уши'
   glad_health_up_skill = 'Церковная целебная гадза'
   glad_critical_up_skill = 'Кошачья критическая гадза'
   glad_damage_down_skill = 'Эльфийская гадза с эффектом попускания'
   glad_poison_skill = 'Ядовитая гадза по-киевски'
   glad_description = 'Владеет арсеналом фирменных гадз'

class Shiva():
   shiva_name = 'Великая Шива'
   shiva_critical_up_skill = 'Криты завезли!'
   shiva_damage_up_skill = 'Урон завезли!'
   shiva_description = 'Божественность дает ей шанс на уворот, с каждым ходом становится критичнее'

class Makar():
   name = 'Король Макар'
   description = 'Это финиш! Твои статы - его статы'

class Gomozeki():
   name = 'Гомогомозеки'
   description = 'Голые, рельефные и агрессивно-активно настроенные'