
class Icons():
   mitya = '👨‍🔬'
   kolya = '👨‍💻'
   temich = '🤷‍♂️'
   sanya = '💇'
   toshik = '🦹‍♂️'

   cooldown = '🕒'
   exchange = '🔄'
   stan = '💤'
   player_health = '❤️'
   boss_health = '🖤'
   damage = '⚔️'
   critical_chance = '💥'
   regeneration = '💕'
   bleeding = '🩸'
   poison = '🦠'
   chains = '⛓'
   obida = '🤬'
   boss = '👿'
   lifesteal = '🦇'
   returnal = '🤕'
   miss = '🛡'

   stage25 = '💀'
   kolbas = '📚'
   polazna = '⛺️'
   god_city = '⚓️'
   badtrip = '😵'
   molebka = '🎇'
   army = '🧨'
   drochilnya = '💦'

class Text():
   hello = 'Приветствую в моем Бургерном рогалике, друг! Играй лучше на телефоне'
   choose_hero = 'Выбери персонажа'
   user_input = 'Напиши мне что-нибудь'
   hero_confirmed_question = 'Берешь его?'
   shop_choice = 'Выбирай куда пойдешь'
   
   boss_choice_question = 'А с кем деремся?'
   location_choice_question = 'А где это я?'

   go_to_jail_button_text = 'Отсидеть'
   jail_effect_text = 'Тюрьма кардиАнально преобразила тебя! Теперь у тебя есть воровской карман'
   jail_reply_button_text = 'Спасибо'
   run_away_button_text = 'Сбежать'
   run_away_effect_text = 'Побег дело святое, но теперь ты в розыске'
   run_away_reply_button_text = 'Сам ты в розыске'
   busted_text = 'Воу воу парень, ты доигрался, милости прошу в автозак'
   
   start_turn = 'Ходи, друг'
   player_stan = 'Не прокатит бро, ты в стане'
   player_silence = 'Сорян, но ты забанен'
   cooldown = 'Обломись, там перезарядка'
   empty = 'Пусто'
   empty_click = 'Не прокатит, друг'
   
   
   
   boss_police_upgrade = 'Босс был усилен стражами порядка'
   
   victory_game = '🥳Похоже ты победил. Круто🥳'
   game_over = '👻Увы, но ты проебал, старина👻\nНапиши мне что-нибудь и начнем сначала'
   victory_fight = 'Ты победил, слабина'
   stan = 'в полном отрубе'
   critical_banner = 'Критический урон!'
   lifesteal_banner = 'Вампирик'
   returnal_banner = 'Обратка'
   player_miss_text = ' скользкий тип\n'
   ressurection_text = 'Произошла воскресуха!'


   
   
   

                                          
   
   
   


class ButtonText():
   mitya_skill = 'Бахнуть элексир'
   kolya_skill = 'Хакнуть урон'
   temich_skill = 'Навести суету'
   sanya_skill = 'Кинуть ножницы'
   toshik_skill = 'Сесть медитировать'

   ready = 'Я готов!'
   victory = 'Я молодец'
   another_hero = 'Давай другого'
   get_fight = 'ПОГНАЛИ'
   attack = 'Атака'
   end_turn = 'Закончить ход'
   restart = 'ДАВАЙ ЕЩЕ РАЗОК'

   bratishki_shop_name = 'Братишкино логово'
   stas_shop_name = 'Лавка Серого Стаса'
   