class Icons():
   mitya = '👨‍🔬'
   kolya = '👨‍💻'
   temich = '🤷‍♂️'
   sanya = '💇'
   toshik = '🦹‍♂️'

   cooldown = '🕒'
   exchange = '🔄'
   stan = '💤'
   player_health = '❤️'
   boss_health = '🖤'
   damage = '⚔️'
   critical_chance = '💥'
   regeneration = '💕'
   bleeding = '🩸'
   poison = '🦠'
   chains = '⛓'
   obida = '🤬'
   boss = '👿'
   lifesteal = '🦇'
   returnal = '🤕'

   stage25 = '💀'
   kolbas = '📚'
   polazna = '⛺️'
   god_city = '⚓️'
   badtrip = '😵'
   molebka = '🎇'
   army = '🧨'
   drochilnya = '💦'

class Text():
   hello = 'Приветствую в моем Бургерном рогалике, друг! Играй лучше на телефоне'
   choose_hero = 'Выбери персонажа'
   user_input = 'Напиши мне что-нибудь'
   hero_confirmed_question = 'Берешь его?'
   shop_choice = 'Выбирай куда пойдешь'
   
   boss_choice_question = 'А с кем деремся?'
   location_choice_question = 'А где это я?'
   go_to_jail_button_text = 'Отсидеть'
   jail_effect_text = 'Тюрьма кардиАнально преобразила тебя! Теперь у тебя есть воровской карман'
   jail_reply_button_text = 'Спасибо'
   run_away_button_text = 'Сбежать'
   run_away_effect_text = 'Побег дело святое, но теперь ты в розыске'
   run_away_reply_button_text = 'Сам ты в розыске'
   get_fight_button_text = 'ПОГНАЛИ'
   busted_text = 'Воу воу парень, ты доигрался, милости прошу в автозак'
   attack_button_text = 'Атака'
   start_turn_text = 'Ходи, друг'
   player_stan_text = 'Не прокатит бро, ты в стане'
   player_silence_text = 'Сорян, но ты забанен'
   cooldown_text = 'Обломись, там перезарядка'
   empty_text = 'Пусто'
   empty_click_text = 'Не прокатит, друг'
   miss_text = '🛡Уворотка🛡\n'
   boss_miss_text = 'Босс пропустил твой урон\n'
   end_turn_button_text = 'Закончить ход'
   boss_police_upgrade_text = 'Босс был усилен стражами порядка'
   restart_button_text = 'ДАВАЙ ЕЩЕ РАЗОК'
   victory_game_text = '🥳Похоже ты победил. Круто🥳'
   game_over_text = '👻Увы, но ты проебал, старина👻\nНапиши мне что-нибудь и начнем сначала'
   victory_fight_text = 'Ты победил, слабина'
   stan_text = 'недееспособен'
   critical_text = 'Критический урон!'
   lifesteal_text = 'Вампирик'
   returnal_text = 'Обратка'
   player_miss_text = ' скользкий тип\n'
   ressurection_text = 'Произошла воскресуха!'
   stan_banner = '        💤Стан💤'
   bleeding_text = '🩸Кровотечение🩸'
   poison_text = '🦠Отравление🦠'
   regeneration_text = '💕Регенерация💕'

   
   
   

   
   
   
   
   
   
   

   

   

   kolbas_name = 'Хата Колбаса'
   kolbas_description = 'Нахождение здесь насыщает тебя благовонием помойки!\n-10%❤️'
   
   polazna_name = 'Полазна'
   polazna_description = 'Палаточные осознанки повысили твою духовность и снизили враждебность\n+20%❤️\n-10%⚔️'
   
   god_city_name = 'Город Богов'
   god_city_description = 'Прогулка по нему разносторонне возвышает тебя\n+10%❤️\n+10%⚔️\n+10%💥'
   
   
   
   
   
   army_name = 'Армия'
   army_description = 'Военкомат добрался до вас, сэр! Армия забрала год твоей жизни, но ты неплохо так подкачался\n-50%❤️\n+30%⚔️'
   

   
   
   

   



class ButtonText():
   mitya_skill = 'Бахнуть элексир'
   kolya_skill = 'Хакнуть урон'
   temich_skill = 'Навести суету'
   sanya_skill = 'Кинуть ножницы'
   toshik_skill = 'Сесть медитировать'

   ready = 'Я готов!'
   victory = 'Я молодец'
   another_hero = 'Давай другого'

   bratishki_shop_name = 'Братишкино логово'
   stas_shop_name = 'Лавка Серого Стаса'
   